{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "B-NAME",
    "2": "I-NAME",
    "3": "E-NAME",
    "4": "S-NAME",
    "5": "B-EMAIL",
    "6": "I-EMAIL",
    "7": "E-EMAIL",
    "8": "S-EMAIL",
    "9": "B-CONTRACT_ID",
    "10": "I-CONTRACT_ID",
    "11": "E-CONTRACT_ID",
    "12": "S-CONTRACT_ID",
    "13": "B-PRODUCT",
    "14": "I-PRODUCT",
    "15": "E-PRODUCT",
    "16": "S-PRODUCT",
    "17": "B-ISSUE_DATE",
    "18": "I-ISSUE_DATE",
    "19": "E-ISSUE_DATE",
    "20": "S-ISSUE_DATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "is_decoder": false,
  "label2id": {
    "B-CONTRACT_ID": 9,
    "B-EMAIL": 5,
    "B-ISSUE_DATE": 17,
    "B-NAME": 1,
    "B-PRODUCT": 13,
    "E-CONTRACT_ID": 11,
    "E-EMAIL": 7,
    "E-ISSUE_DATE": 19,
    "E-NAME": 3,
    "E-PRODUCT": 15,
    "I-CONTRACT_ID": 10,
    "I-EMAIL": 6,
    "I-ISSUE_DATE": 18,
    "I-NAME": 2,
    "I-PRODUCT": 14,
    "O": 0,
    "S-CONTRACT_ID": 12,
    "S-EMAIL": 8,
    "S-ISSUE_DATE": 20,
    "S-NAME": 4,
    "S-PRODUCT": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
